2024-1-18/2259f59c19-RECD.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pdev-&gt;id</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">pdev-&gt;id</h1>
<p>
从devicetree过来的，基本上都是 pdev-&gt;id = PLATFORM_DEVID_NONE;
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">drivers/of/device.c</span>
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">of_device_add</span>(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">platform_device</span> *<span style="font-weight: bold; font-style: italic;">ofdev</span>)
  {
          BUG_ON(ofdev-&gt;dev.of_node == <span style="font-weight: bold; text-decoration: underline;">NULL</span>);

          <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">name and id have to be set so that the platform bus doesn't get</span>
<span style="font-weight: bold; font-style: italic;">           * confused on matching</span><span style="font-weight: bold; font-style: italic;"> */</span>
          ofdev-&gt;name = dev_name(&amp;ofdev-&gt;dev);
          ofdev-&gt;id = PLATFORM_DEVID_NONE;

          <span style="font-weight: bold; font-style: italic;">/*</span>
<span style="font-weight: bold; font-style: italic;">           * If this device has not binding numa node in devicetree, that is</span>
<span style="font-weight: bold; font-style: italic;">           * of_node_to_nid returns NUMA_NO_NODE. device_add will assume that this</span>
<span style="font-weight: bold; font-style: italic;">           * device is on the same node as the parent.</span>
<span style="font-weight: bold; font-style: italic;">           */</span>
          set_dev_node(&amp;ofdev-&gt;dev, of_node_to_nid(ofdev-&gt;dev.of_node));

          <span style="font-weight: bold;">return</span> device_add(&amp;ofdev-&gt;dev);
  }


  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">drivers/of/platform.c</span>
  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">platform_device</span> *<span style="font-weight: bold;">of_device_alloc</span>(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">device_node</span> *<span style="font-weight: bold; font-style: italic;">np</span>,
                                          <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">bus_id</span>,
                                          <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">device</span> *<span style="font-weight: bold; font-style: italic;">parent</span>)
  {
          dev = platform_device_alloc(<span style="font-style: italic;">""</span>, PLATFORM_DEVID_NONE);
          <span style="font-weight: bold;">if</span> (!dev)
                  <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
          ...;
  }



  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">drivers/base/platform.c</span>
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">platform_device_add</span>(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">platform_device</span> *<span style="font-weight: bold; font-style: italic;">pdev</span>)
  {
          <span style="font-weight: bold; text-decoration: underline;">u32</span> <span style="font-weight: bold; font-style: italic;">i</span>;
          <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">ret</span>;

          <span style="font-weight: bold;">if</span> (!pdev)
                  <span style="font-weight: bold;">return</span> -EINVAL;

          <span style="font-weight: bold;">if</span> (!pdev-&gt;dev.parent)
                  pdev-&gt;dev.parent = &amp;platform_bus;

          pdev-&gt;dev.bus = &amp;platform_bus_type;

          <span style="font-weight: bold;">switch</span> (pdev-&gt;id) {
          <span style="font-weight: bold;">default</span>:
                  dev_set_name(&amp;pdev-&gt;dev, <span style="font-style: italic;">"%s.%d"</span>, pdev-&gt;name,  pdev-&gt;id);
                  <span style="font-weight: bold;">break</span>;
          <span style="font-weight: bold;">case</span> PLATFORM_DEVID_NONE:
                  dev_set_name(&amp;pdev-&gt;dev, <span style="font-style: italic;">"%s"</span>, pdev-&gt;name);
                  <span style="font-weight: bold;">break</span>;
          <span style="font-weight: bold;">case</span> PLATFORM_DEVID_AUTO:
                  <span style="font-weight: bold; font-style: italic;">/*</span>
<span style="font-weight: bold; font-style: italic;">                   * Automatically allocated device ID. We mark it as such so</span>
<span style="font-weight: bold; font-style: italic;">                   * that we remember it must be freed, and we append a suffix</span>
<span style="font-weight: bold; font-style: italic;">                   * to avoid namespace collision with explicit IDs.</span>
<span style="font-weight: bold; font-style: italic;">                   */</span>
                  ret = ida_alloc(&amp;platform_devid_ida, GFP_KERNEL);
                  <span style="font-weight: bold;">if</span> (ret &lt; 0)
                          <span style="font-weight: bold;">goto</span> <span style="font-weight: bold; text-decoration: underline;">err_out</span>;
                  pdev-&gt;id = ret;
                  pdev-&gt;id_auto = <span style="font-weight: bold; text-decoration: underline;">true</span>;
                  dev_set_name(&amp;pdev-&gt;dev, <span style="font-style: italic;">"%s.%d.auto"</span>, pdev-&gt;name, pdev-&gt;id);
                  <span style="font-weight: bold;">break</span>;
          }
  }
</pre>
</div>
<p>
因此，在写驱动时，这个pdev-&gt;id基本上都是-1。
可从of_alias获取索引，或自定义设备树节点属性。
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
